app/controllers/work/alias_names_controller.rb

SELECT  `alias_names`.* FROM `alias_names` LIMIT 10 OFFSET 0
---
  def index
    @q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @alias_names = AliasName.default_where(search_params).page(params[:page]).per(10)