app/controllers/work/medicines_controller.rb

SELECT  `medicines`.* FROM `medicines` LIMIT 10 OFFSET 0
---
  def index
    @medicines = Medicine.all.page(params[:page]).per(10)